# Steps for preprocessing
### Import the dataframe
### check the shape and info
### Spot univariate analysis using the describe fuction
### Missing value analysis using isnull()
### Missing value imputation using fillna()
### Pandas type casting()
    ### astype(int) to cast a integer column
    ### astype(float) to cast a column to float
    ### mapping, astype('category'), .cat.codes for ordinals and Flag
    ### pd.get_dummies() for nominals
    ### pd.to_Datetime() for date

In [2]:
import numpy as np
import pandas as pd

In [89]:
# Importing 
df = pd.read_csv('eaa.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
Age                         1470 non-null int64
Attrition                   1470 non-null object
BusinessTravel              1470 non-null object
DailyRate                   1470 non-null int64
Department                  1470 non-null object
DistanceFromHome            1470 non-null int64
Education                   1470 non-null int64
EducationField              1470 non-null object
EmployeeCount               1470 non-null int64
EmployeeNumber              1470 non-null int64
EnvironmentSatisfaction     1470 non-null int64
Gender                      1470 non-null object
HourlyRate                  1470 non-null int64
JobInvolvement              1470 non-null int64
JobLevel                    1470 non-null int64
JobRole                     1470 non-null object
JobSatisfaction             1470 non-null int64
MaritalStatus               1470 non-null object
MonthlyIncome               1470 non-null int64
MonthlyRate                 1470 non-null int64
NumCompaniesWorked          1470 non-null int64
Over18                      1470 non-null object
OverTime                    1470 non-null object
PercentSalaryHike           1470 non-null int64
PerformanceRating           1470 non-null int64
RelationshipSatisfaction    1470 non-null int64
StandardHours               1470 non-null int64
StockOptionLevel            1470 non-null int64
TotalWorkingYears           1470 non-null int64
TrainingTimesLastYear       1470 non-null int64
WorkLifeBalance             1470 non-null int64
YearsAtCompany              1470 non-null int64
YearsInCurrentRole          1470 non-null int64
YearsSinceLastPromotion     1470 non-null int64
YearsWithCurrManager        1470 non-null int64
dtypes: int64(26), object(9)
memory usage: 402.0+ KB

In [65]:
df = df.iloc[:, :9]

In [13]:
df.shape

(1470, 9)

In [16]:
nums = df.select_dtypes(include = [np.number])
non_nums = df.select_dtypes(include = [np.object])

In [17]:
nums.describe(include= 'all')

               Age    DailyRate  DistanceFromHome    Education  EmployeeCount
count  1470.000000  1470.000000       1470.000000  1470.000000         1470.0
mean     36.923810   802.485714          9.192517     2.912925            1.0
std       9.135373   403.509100          8.106864     1.024165            0.0
min      18.000000   102.000000          1.000000     1.000000            1.0
25%      30.000000   465.000000          2.000000     2.000000            1.0
50%      36.000000   802.000000          7.000000     3.000000            1.0
75%      43.000000  1157.000000         14.000000     4.000000            1.0
max      60.000000  1499.000000         29.000000     5.000000            1.0

In [18]:
non_nums.describe()

       Attrition BusinessTravel              Department EducationField
count       1470           1470                    1470           1470
unique         2              3                       3              6
top           No  Travel_Rarely  Research & Development  Life Sciences
freq        1233           1043                     961            606

In [21]:
df.isnull().sum().sum()

0

In [22]:
# Missing value analysis and imputation is leftover

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 9 columns):
Age                 1470 non-null int64
Attrition           1470 non-null object
BusinessTravel      1470 non-null object
DailyRate           1470 non-null int64
Department          1470 non-null object
DistanceFromHome    1470 non-null int64
Education           1470 non-null int64
EducationField      1470 non-null object
EmployeeCount       1470 non-null int64
dtypes: int64(5), object(4)
memory usage: 103.4+ KB

In [66]:
# Attrition has been flaged
df['Attrition'] = df['Attrition'].astype('category')
df['Attrition'] = df['Attrition'].cat.codes

In [67]:
df['Attrition'].dtypes

dtype('int8')

In [68]:
# Business Travel
mapper = {'Travel_Rarely':1 ,'Travel_Frequently':2,'Non-Travel':0}

In [69]:
df['BusinessTravel'].value_counts()

Travel_Rarely        1043
Travel_Frequently     277
Non-Travel            150
Name: BusinessTravel, dtype: int64

In [70]:
 df['BusinessTravel'] = df['BusinessTravel'].map(mapper)

In [71]:
 df['BusinessTravel'] =  df['BusinessTravel'].astype('category')

In [72]:
# Binary encoding Department

In [76]:
df = pd.get_dummies(df, columns= ['Department'], prefix = 'dept', drop_first =  True)

In [77]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,dept_Research & Development,dept_Sales
0,41,1,1,1102,1,2,Life Sciences,1,1,0,1
1,49,0,2,279,8,1,Life Sciences,1,2,1,0
2,37,1,1,1373,2,2,Other,1,4,1,0
3,33,0,2,1392,3,4,Life Sciences,1,5,1,0
4,27,0,1,591,2,1,Medical,1,7,1,0

In [85]:
df = pd.get_dummies(df,columns = ['EducationField'] , prefix = 'Edu', drop_first= True)

KeyError: "None of [Index(['EducationField'], dtype='object')] are in the [columns]"

In [84]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber,dept_Research & Development,dept_Sales,Edu_Human Resources,Edu_Life Sciences,Edu_Marketing,Edu_Medical,Edu_Other,Edu_Technical Degree
0,41,1,1,1102,1,2,1,1,0,1,0,1,0,0,0,0
1,49,0,2,279,8,1,1,2,1,0,0,1,0,0,0,0
2,37,1,1,1373,2,2,1,4,1,0,0,0,0,0,1,0
3,33,0,2,1392,3,4,1,5,1,0,0,1,0,0,0,0
4,27,0,1,591,2,1,1,7,1,0,0,0,0,1,0,0

In [88]:
pd.read_csv('eaa.csv')['EducationField'].value_counts()

Life Sciences       606
Medical             464
Marketing           159
Technical Degree    132
Other                82
Human Resources      27
Name: EducationField, dtype: int64

# Try to type cast the rest of the columns yourself
## Happy Analysis